; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p10---int100n150-m25---int100c150---s346---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level10 level10)
(sum level0 level17 level17)
(sum level0 level21 level21)
(sum level0 level23 level23)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level10 level11)
(sum level1 level17 level18)
(sum level1 level21 level22)
(sum level1 level23 level24)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level10 level12)
(sum level2 level17 level19)
(sum level2 level21 level23)
(sum level2 level23 level25)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level10 level13)
(sum level3 level17 level20)
(sum level3 level21 level24)
(sum level3 level23 level26)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level10 level14)
(sum level4 level17 level21)
(sum level4 level21 level25)
(sum level4 level23 level27)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level10 level15)
(sum level5 level17 level22)
(sum level5 level21 level26)
(sum level5 level23 level28)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level10 level16)
(sum level6 level17 level23)
(sum level6 level21 level27)
(sum level6 level23 level29)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level10 level17)
(sum level7 level17 level24)
(sum level7 level21 level28)
(sum level7 level23 level30)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level10 level18)
(sum level8 level17 level25)
(sum level8 level21 level29)
(sum level8 level23 level31)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level10 level19)
(sum level9 level17 level26)
(sum level9 level21 level30)
(sum level9 level23 level32)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level10 level20)
(sum level10 level17 level27)
(sum level10 level21 level31)
(sum level10 level23 level33)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level10 level21)
(sum level11 level17 level28)
(sum level11 level21 level32)
(sum level11 level23 level34)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level10 level22)
(sum level12 level17 level29)
(sum level12 level21 level33)
(sum level12 level23 level35)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level10 level23)
(sum level13 level17 level30)
(sum level13 level21 level34)
(sum level13 level23 level36)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level10 level24)
(sum level14 level17 level31)
(sum level14 level21 level35)
(sum level14 level23 level37)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level10 level25)
(sum level15 level17 level32)
(sum level15 level21 level36)
(sum level15 level23 level38)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level10 level26)
(sum level16 level17 level33)
(sum level16 level21 level37)
(sum level16 level23 level39)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level10 level27)
(sum level17 level17 level34)
(sum level17 level21 level38)
(sum level17 level23 level40)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level10 level28)
(sum level18 level17 level35)
(sum level18 level21 level39)
(sum level18 level23 level41)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level10 level29)
(sum level19 level17 level36)
(sum level19 level21 level40)
(sum level19 level23 level42)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level10 level30)
(sum level20 level17 level37)
(sum level20 level21 level41)
(sum level20 level23 level43)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level10 level31)
(sum level21 level17 level38)
(sum level21 level21 level42)
(sum level21 level23 level44)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level10 level32)
(sum level22 level17 level39)
(sum level22 level21 level43)
(sum level22 level23 level45)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level10 level33)
(sum level23 level17 level40)
(sum level23 level21 level44)
(sum level23 level23 level46)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level10 level34)
(sum level24 level17 level41)
(sum level24 level21 level45)
(sum level24 level23 level47)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level10 level35)
(sum level25 level17 level42)
(sum level25 level21 level46)
(sum level25 level23 level48)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level10 level36)
(sum level26 level17 level43)
(sum level26 level21 level47)
(sum level26 level23 level49)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level10 level37)
(sum level27 level17 level44)
(sum level27 level21 level48)
(sum level27 level23 level50)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level10 level38)
(sum level28 level17 level45)
(sum level28 level21 level49)
(sum level28 level23 level51)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level10 level39)
(sum level29 level17 level46)
(sum level29 level21 level50)
(sum level29 level23 level52)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level10 level40)
(sum level30 level17 level47)
(sum level30 level21 level51)
(sum level30 level23 level53)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level10 level41)
(sum level31 level17 level48)
(sum level31 level21 level52)
(sum level31 level23 level54)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level10 level42)
(sum level32 level17 level49)
(sum level32 level21 level53)
(sum level32 level23 level55)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level10 level43)
(sum level33 level17 level50)
(sum level33 level21 level54)
(sum level33 level23 level56)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level10 level44)
(sum level34 level17 level51)
(sum level34 level21 level55)
(sum level34 level23 level57)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level10 level45)
(sum level35 level17 level52)
(sum level35 level21 level56)
(sum level35 level23 level58)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level10 level46)
(sum level36 level17 level53)
(sum level36 level21 level57)
(sum level36 level23 level59)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level10 level47)
(sum level37 level17 level54)
(sum level37 level21 level58)
(sum level37 level23 level60)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level10 level48)
(sum level38 level17 level55)
(sum level38 level21 level59)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level10 level49)
(sum level39 level17 level56)
(sum level39 level21 level60)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level10 level50)
(sum level40 level17 level57)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level10 level51)
(sum level41 level17 level58)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level10 level52)
(sum level42 level17 level59)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level10 level53)
(sum level43 level17 level60)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level10 level54)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level10 level55)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level10 level56)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level10 level57)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level10 level58)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level10 level59)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level10 level60)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level4 level60)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level58 level2 level60)

(connected l0 l1)
(fuelcost level6 l0 l1)
(connected l0 l5)
(fuelcost level23 l0 l5)
(connected l1 l0)
(fuelcost level6 l1 l0)
(connected l1 l3)
(fuelcost level10 l1 l3)
(connected l1 l4)
(fuelcost level3 l1 l4)
(connected l1 l5)
(fuelcost level17 l1 l5)
(connected l2 l4)
(fuelcost level5 l2 l4)
(connected l2 l5)
(fuelcost level2 l2 l5)
(connected l3 l1)
(fuelcost level10 l3 l1)
(connected l3 l4)
(fuelcost level4 l3 l4)
(connected l3 l5)
(fuelcost level21 l3 l5)
(connected l4 l1)
(fuelcost level3 l4 l1)
(connected l4 l2)
(fuelcost level5 l4 l2)
(connected l4 l3)
(fuelcost level4 l4 l3)
(connected l5 l0)
(fuelcost level23 l5 l0)
(connected l5 l1)
(fuelcost level17 l5 l1)
(connected l5 l2)
(fuelcost level2 l5 l2)
(connected l5 l3)
(fuelcost level21 l5 l3)

(at t0 l1)
(fuel t0 level60)
(= (total-cost) 0)

(at p0 l5)
(at p1 l3)
(at p2 l5)
(at p3 l0)
(at p4 l1)
(at p5 l0)
(at p6 l3)
(at p7 l1)
(at p8 l0)
(at p9 l4)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l1)
(at p3 l3)
(at p4 l0)
(at p5 l5)
(at p6 l5)
(at p7 l4)
(at p8 l5)
(at p9 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 10
2. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 10
3. (drive t0 l1 l0 level54 level6 level60)
   deleted: (at t0 l1) (fuel t0 level60)
   added: (at t0 l0) (fuel t0 level54)
   goals met: 0 of 10
4. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 1 of 10
5. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 1 of 10
6. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 1 of 10
7. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 10
8. (drive t0 l0 l1 level48 level6 level54)
   deleted: (at t0 l0) (fuel t0 level54)
   added: (at t0 l1) (fuel t0 level48)
   goals met: 1 of 10
9. (drive t0 l1 l4 level45 level3 level48)
   deleted: (at t0 l1) (fuel t0 level48)
   added: (at t0 l4) (fuel t0 level45)
   goals met: 1 of 10
10. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 2 of 10
11. (load p9 t0 l4)
   deleted: (at p9 l4)
   added: (in p9 t0)
   goals met: 2 of 10
12. (drive t0 l4 l3 level41 level4 level45)
   deleted: (at t0 l4) (fuel t0 level45)
   added: (at t0 l3) (fuel t0 level41)
   goals met: 2 of 10
13. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 2 of 10
14. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 2 of 10
15. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 3 of 10
16. (drive t0 l3 l5 level20 level21 level41)
   deleted: (at t0 l3) (fuel t0 level41)
   added: (at t0 l5) (fuel t0 level20)
   goals met: 3 of 10
17. (load p0 t0 l5)
   deleted: (at p0 l5)
   added: (in p0 t0)
   goals met: 3 of 10
18. (load p2 t0 l5)
   deleted: (at p2 l5)
   added: (in p2 t0)
   goals met: 3 of 10
19. (unload p5 t0 l5)
   deleted: (in p5 t0)
   added: (at p5 l5)
   goals met: 4 of 10
20. (unload p6 t0 l5)
   deleted: (in p6 t0)
   added: (at p6 l5)
   goals met: 5 of 10
21. (unload p8 t0 l5)
   deleted: (in p8 t0)
   added: (at p8 l5)
   goals met: 6 of 10
22. (unload p9 t0 l5)
   deleted: (in p9 t0)
   added: (at p9 l5)
   goals met: 7 of 10
23. (drive t0 l5 l1 level3 level17 level20)
   deleted: (at t0 l5) (fuel t0 level20)
   added: (at t0 l1) (fuel t0 level3)
   goals met: 7 of 10
24. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 8 of 10
25. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 9 of 10
26. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 10 of 10
